espressif/esp-idf/components/soc/esp32s31/register/soc/cnnt_sys_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CNNT_SYS_VER_DATE_REG register
 *  NA
 */
#define CNNT_SYS_VER_DATE_REG (DR_REG_CNNT_BASE + 0x0)
/** CNNT_SYS_VER_DATE : R/W; bitpos: [31:0]; default: 539298086;
 *  NA
 */
#define CNNT_SYS_VER_DATE    0xFFFFFFFFU
#define CNNT_SYS_VER_DATE_M  (CNNT_SYS_VER_DATE_V << CNNT_SYS_VER_DATE_S)
#define CNNT_SYS_VER_DATE_V  0xFFFFFFFFU
#define CNNT_SYS_VER_DATE_S  0

/** CNNT_CLK_EN_REG register
 *  NA
 */
#define CNNT_CLK_EN_REG (DR_REG_CNNT_BASE + 0x4)
/** CNNT_SYS_DATE : R/W; bitpos: [30:0]; default: 38826240;
 *  need_des
 */
#define CNNT_SYS_DATE    0x7FFFFFFFU
#define CNNT_SYS_DATE_M  (CNNT_SYS_DATE_V << CNNT_SYS_DATE_S)
#define CNNT_SYS_DATE_V  0x7FFFFFFFU
#define CNNT_SYS_DATE_S  0
/** CNNT_SYS_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  NA
 */
#define CNNT_SYS_CLK_EN    (BIT(31))
#define CNNT_SYS_CLK_EN_M  (CNNT_SYS_CLK_EN_V << CNNT_SYS_CLK_EN_S)
#define CNNT_SYS_CLK_EN_V  0x00000001U
#define CNNT_SYS_CLK_EN_S  31

/** CNNT_SYS_SDMMC_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define CNNT_SYS_SDMMC_MEM_LP_CTRL_REG (DR_REG_CNNT_BASE + 0x10)
/** CNNT_SYS_SDMMC_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures sdmmc memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define CNNT_SYS_SDMMC_MEM_LP_MODE    0x00000003U
#define CNNT_SYS_SDMMC_MEM_LP_MODE_M  (CNNT_SYS_SDMMC_MEM_LP_MODE_V << CNNT_SYS_SDMMC_MEM_LP_MODE_S)
#define CNNT_SYS_SDMMC_MEM_LP_MODE_V  0x00000003U
#define CNNT_SYS_SDMMC_MEM_LP_MODE_S  0
/** CNNT_SYS_SDMMC_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down sdmmc memory.
 */
#define CNNT_SYS_SDMMC_MEM_LP_EN    (BIT(2))
#define CNNT_SYS_SDMMC_MEM_LP_EN_M  (CNNT_SYS_SDMMC_MEM_LP_EN_V << CNNT_SYS_SDMMC_MEM_LP_EN_S)
#define CNNT_SYS_SDMMC_MEM_LP_EN_V  0x00000001U
#define CNNT_SYS_SDMMC_MEM_LP_EN_S  2
/** CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control sdmmc memory, disable hardware control.
 */
#define CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL    (BIT(3))
#define CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL_M  (CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL_V << CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL_S)
#define CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL_V  0x00000001U
#define CNNT_SYS_SDMMC_MEM_LP_FORCE_CTRL_S  3

/** CNNT_SYS_USB_OTGHS_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define CNNT_SYS_USB_OTGHS_MEM_LP_CTRL_REG (DR_REG_CNNT_BASE + 0x14)
/** CNNT_SYS_USB_OTGHS_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures usb_otghs memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define CNNT_SYS_USB_OTGHS_MEM_LP_MODE    0x00000003U
#define CNNT_SYS_USB_OTGHS_MEM_LP_MODE_M  (CNNT_SYS_USB_OTGHS_MEM_LP_MODE_V << CNNT_SYS_USB_OTGHS_MEM_LP_MODE_S)
#define CNNT_SYS_USB_OTGHS_MEM_LP_MODE_V  0x00000003U
#define CNNT_SYS_USB_OTGHS_MEM_LP_MODE_S  0
/** CNNT_SYS_USB_OTGHS_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down usb_otghs memory.
 */
#define CNNT_SYS_USB_OTGHS_MEM_LP_EN    (BIT(2))
#define CNNT_SYS_USB_OTGHS_MEM_LP_EN_M  (CNNT_SYS_USB_OTGHS_MEM_LP_EN_V << CNNT_SYS_USB_OTGHS_MEM_LP_EN_S)
#define CNNT_SYS_USB_OTGHS_MEM_LP_EN_V  0x00000001U
#define CNNT_SYS_USB_OTGHS_MEM_LP_EN_S  2
/** CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control usb_otghs memory, disable hardware control.
 */
#define CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL    (BIT(3))
#define CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL_M  (CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL_V << CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL_S)
#define CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL_V  0x00000001U
#define CNNT_SYS_USB_OTGHS_MEM_LP_FORCE_CTRL_S  3

/** CNNT_SYS_USB_DEVICE_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define CNNT_SYS_USB_DEVICE_MEM_LP_CTRL_REG (DR_REG_CNNT_BASE + 0x18)
/** CNNT_SYS_USB_DEVICE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures usb_device memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define CNNT_SYS_USB_DEVICE_MEM_LP_MODE    0x00000003U
#define CNNT_SYS_USB_DEVICE_MEM_LP_MODE_M  (CNNT_SYS_USB_DEVICE_MEM_LP_MODE_V << CNNT_SYS_USB_DEVICE_MEM_LP_MODE_S)
#define CNNT_SYS_USB_DEVICE_MEM_LP_MODE_V  0x00000003U
#define CNNT_SYS_USB_DEVICE_MEM_LP_MODE_S  0
/** CNNT_SYS_USB_DEVICE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down usb_device memory.
 */
#define CNNT_SYS_USB_DEVICE_MEM_LP_EN    (BIT(2))
#define CNNT_SYS_USB_DEVICE_MEM_LP_EN_M  (CNNT_SYS_USB_DEVICE_MEM_LP_EN_V << CNNT_SYS_USB_DEVICE_MEM_LP_EN_S)
#define CNNT_SYS_USB_DEVICE_MEM_LP_EN_V  0x00000001U
#define CNNT_SYS_USB_DEVICE_MEM_LP_EN_S  2
/** CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control usb_device (serial jtag) memory, disable
 *  hardware control.
 */
#define CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL    (BIT(3))
#define CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL_M  (CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL_V << CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL_S)
#define CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL_V  0x00000001U
#define CNNT_SYS_USB_DEVICE_MEM_LP_FORCE_CTRL_S  3

/** CNNT_SYS_GMAC_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define CNNT_SYS_GMAC_MEM_LP_CTRL_REG (DR_REG_CNNT_BASE + 0x1c)
/** CNNT_SYS_GMAC_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures gmac memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define CNNT_SYS_GMAC_MEM_LP_MODE    0x00000003U
#define CNNT_SYS_GMAC_MEM_LP_MODE_M  (CNNT_SYS_GMAC_MEM_LP_MODE_V << CNNT_SYS_GMAC_MEM_LP_MODE_S)
#define CNNT_SYS_GMAC_MEM_LP_MODE_V  0x00000003U
#define CNNT_SYS_GMAC_MEM_LP_MODE_S  0
/** CNNT_SYS_GMAC_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down gmac memory.
 */
#define CNNT_SYS_GMAC_MEM_LP_EN    (BIT(2))
#define CNNT_SYS_GMAC_MEM_LP_EN_M  (CNNT_SYS_GMAC_MEM_LP_EN_V << CNNT_SYS_GMAC_MEM_LP_EN_S)
#define CNNT_SYS_GMAC_MEM_LP_EN_V  0x00000001U
#define CNNT_SYS_GMAC_MEM_LP_EN_S  2
/** CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control gmac memory, disable hardware control.
 */
#define CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL    (BIT(3))
#define CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL_M  (CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL_V << CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL_S)
#define CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL_V  0x00000001U
#define CNNT_SYS_GMAC_MEM_LP_FORCE_CTRL_S  3

/** CNNT_SYS_SPRF_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_SPRF_MEM_AUX_CTRL_REG (DR_REG_CNNT_BASE + 0x20)
/** CNNT_SYS_SPRF_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define CNNT_SYS_SPRF_MEM_AUX_CTRL    0xFFFFFFFFU
#define CNNT_SYS_SPRF_MEM_AUX_CTRL_M  (CNNT_SYS_SPRF_MEM_AUX_CTRL_V << CNNT_SYS_SPRF_MEM_AUX_CTRL_S)
#define CNNT_SYS_SPRF_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define CNNT_SYS_SPRF_MEM_AUX_CTRL_S  0

