espressif/esp-idf/components/soc/esp32s31/register/soc/cnnt_sys_reg.h
/** CNNT_SYS_SDPRF_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_SDPRF_MEM_AUX_CTRL_REG (DR_REG_CNNT_BASE + 0x24)
/** CNNT_SYS_SDPRF_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define CNNT_SYS_SDPRF_MEM_AUX_CTRL    0xFFFFFFFFU
#define CNNT_SYS_SDPRF_MEM_AUX_CTRL_M  (CNNT_SYS_SDPRF_MEM_AUX_CTRL_V << CNNT_SYS_SDPRF_MEM_AUX_CTRL_S)
#define CNNT_SYS_SDPRF_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define CNNT_SYS_SDPRF_MEM_AUX_CTRL_S  0

/** CNNT_SYS_HP_PAD_ULPI_CTRL_REG register
 *  HP Clock Control Register.
 */
#define CNNT_SYS_HP_PAD_ULPI_CTRL_REG (DR_REG_CNNT_BASE + 0x28)
/** CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN : R/W; bitpos: [30]; default: 0;
 *  PAD ULPI Clock output inv Enable, valid only when CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN
 *  is 1.
 */
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN    (BIT(30))
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN_M  (CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN_V << CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN_S)
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN_V  0x00000001U
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_INV_EN_S  30
/** CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN : R/W; bitpos: [31]; default: 0;
 *  PAD ULPI Clock output Enable. 0: pad_ulpi_clk is used as input clk, 1: pad_ulpi_clk
 *  is used as output clk
 */
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN    (BIT(31))
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN_M  (CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN_V << CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN_S)
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN_V  0x00000001U
#define CNNT_SYS_HP_PAD_ULPI_CLK_OUT_EN_S  31

/** CNNT_SYS_USB_CLK_CTRL_REG register
 *  HP USB Clock Reset Control Register.
 */
#define CNNT_SYS_USB_CLK_CTRL_REG (DR_REG_CNNT_BASE + 0x2c)
/** CNNT_SYS_USB_48M_DIV_NUM : R/W; bitpos: [15:8]; default: 9;
 *  usb 480m to 25m divide number.
 */
#define CNNT_SYS_USB_48M_DIV_NUM    0x000000FFU
#define CNNT_SYS_USB_48M_DIV_NUM_M  (CNNT_SYS_USB_48M_DIV_NUM_V << CNNT_SYS_USB_48M_DIV_NUM_S)
#define CNNT_SYS_USB_48M_DIV_NUM_V  0x000000FFU
#define CNNT_SYS_USB_48M_DIV_NUM_S  8
/** CNNT_SYS_USB_25M_DIV_NUM : R/W; bitpos: [23:16]; default: 19;
 *  usb 500m to 25m divide number.
 */
#define CNNT_SYS_USB_25M_DIV_NUM    0x000000FFU
#define CNNT_SYS_USB_25M_DIV_NUM_M  (CNNT_SYS_USB_25M_DIV_NUM_V << CNNT_SYS_USB_25M_DIV_NUM_S)
#define CNNT_SYS_USB_25M_DIV_NUM_V  0x000000FFU
#define CNNT_SYS_USB_25M_DIV_NUM_S  16
/** CNNT_SYS_USB_12M_DIV_NUM : R/W; bitpos: [31:24]; default: 39;
 *  usb 480m to 12m divide number.
 */
#define CNNT_SYS_USB_12M_DIV_NUM    0x000000FFU
#define CNNT_SYS_USB_12M_DIV_NUM_M  (CNNT_SYS_USB_12M_DIV_NUM_V << CNNT_SYS_USB_12M_DIV_NUM_S)
#define CNNT_SYS_USB_12M_DIV_NUM_V  0x000000FFU
#define CNNT_SYS_USB_12M_DIV_NUM_S  24

/** CNNT_SYS_USB_OTG20_CTRL_REG register
 *  HP USB Clock Reset Control Register.
 */
#define CNNT_SYS_USB_OTG20_CTRL_REG (DR_REG_CNNT_BASE + 0x30)
/** CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN : R/W; bitpos: [23]; default: 1;
 *  usb otg20 utmifs clk enable.
 */
#define CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN    (BIT(23))
#define CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN_M  (CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN_V << CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN_S)
#define CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN_V  0x00000001U
#define CNNT_SYS_USB_OTG20_UTMIFS_CLK_EN_S  23
/** CNNT_SYS_USB_OTG20_ULPI_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  usb otg20 ulpi clk enable.
 */
#define CNNT_SYS_USB_OTG20_ULPI_CLK_EN    (BIT(24))
#define CNNT_SYS_USB_OTG20_ULPI_CLK_EN_M  (CNNT_SYS_USB_OTG20_ULPI_CLK_EN_V << CNNT_SYS_USB_OTG20_ULPI_CLK_EN_S)
#define CNNT_SYS_USB_OTG20_ULPI_CLK_EN_V  0x00000001U
#define CNNT_SYS_USB_OTG20_ULPI_CLK_EN_S  24
/** CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL : R/W; bitpos: [26:25]; default: 0;
 *  usb otg20 hs phy src sel. 2''d0: 12m, 2''d1: 25m, 2''d2: pad_hsphy_refclk.'
 */
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL    0x00000003U
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL_M  (CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL_V << CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL_S)
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL_V  0x00000003U
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_SRC_SEL_S  25
/** CNNT_SYS_USB_OTG20_PHYREF_CLK_EN : R/W; bitpos: [27]; default: 0;
 *  usb otg20 hs phy refclk enable.
 */
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_EN    (BIT(27))
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_EN_M  (CNNT_SYS_USB_OTG20_PHYREF_CLK_EN_V << CNNT_SYS_USB_OTG20_PHYREF_CLK_EN_S)
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_EN_V  0x00000001U
#define CNNT_SYS_USB_OTG20_PHYREF_CLK_EN_S  27
/** CNNT_SYS_USB_OTG20_PHY_RST_EN : R/W; bitpos: [29]; default: 1;
 *  usb otg20 phy reset en
 */
#define CNNT_SYS_USB_OTG20_PHY_RST_EN    (BIT(29))
#define CNNT_SYS_USB_OTG20_PHY_RST_EN_M  (CNNT_SYS_USB_OTG20_PHY_RST_EN_V << CNNT_SYS_USB_OTG20_PHY_RST_EN_S)
#define CNNT_SYS_USB_OTG20_PHY_RST_EN_V  0x00000001U
#define CNNT_SYS_USB_OTG20_PHY_RST_EN_S  29
/** CNNT_SYS_USB_OTG20_AHB_RST_EN : R/W; bitpos: [30]; default: 1;
 *  usb otg20 ahb reset en
 */
#define CNNT_SYS_USB_OTG20_AHB_RST_EN    (BIT(30))
#define CNNT_SYS_USB_OTG20_AHB_RST_EN_M  (CNNT_SYS_USB_OTG20_AHB_RST_EN_V << CNNT_SYS_USB_OTG20_AHB_RST_EN_S)
#define CNNT_SYS_USB_OTG20_AHB_RST_EN_V  0x00000001U
#define CNNT_SYS_USB_OTG20_AHB_RST_EN_S  30
/** CNNT_SYS_USB_OTG20_APB_RST_EN : R/W; bitpos: [31]; default: 1;
 *  usb otg20 apb reset en
 */
#define CNNT_SYS_USB_OTG20_APB_RST_EN    (BIT(31))
#define CNNT_SYS_USB_OTG20_APB_RST_EN_M  (CNNT_SYS_USB_OTG20_APB_RST_EN_V << CNNT_SYS_USB_OTG20_APB_RST_EN_S)
#define CNNT_SYS_USB_OTG20_APB_RST_EN_V  0x00000001U
#define CNNT_SYS_USB_OTG20_APB_RST_EN_S  31

/** CNNT_SYS_HP_USB_DEVICE_CTRL_REG register
 *  HP USB Clock Reset Control Register.
 */
#define CNNT_SYS_HP_USB_DEVICE_CTRL_REG (DR_REG_CNNT_BASE + 0x34)
/** CNNT_SYS_USB_DEVICE_48M_CLK_EN : R/W; bitpos: [30]; default: 1;
 *  usb device fs phy clock enable.
 */
#define CNNT_SYS_USB_DEVICE_48M_CLK_EN    (BIT(30))
#define CNNT_SYS_USB_DEVICE_48M_CLK_EN_M  (CNNT_SYS_USB_DEVICE_48M_CLK_EN_V << CNNT_SYS_USB_DEVICE_48M_CLK_EN_S)
#define CNNT_SYS_USB_DEVICE_48M_CLK_EN_V  0x00000001U
#define CNNT_SYS_USB_DEVICE_48M_CLK_EN_S  30
/** CNNT_SYS_USB_DEVICE_RST_EN : R/W; bitpos: [31]; default: 0;
 *  usb device reset en
 */
#define CNNT_SYS_USB_DEVICE_RST_EN    (BIT(31))
#define CNNT_SYS_USB_DEVICE_RST_EN_M  (CNNT_SYS_USB_DEVICE_RST_EN_V << CNNT_SYS_USB_DEVICE_RST_EN_S)
#define CNNT_SYS_USB_DEVICE_RST_EN_V  0x00000001U
#define CNNT_SYS_USB_DEVICE_RST_EN_S  31

/** CNNT_SYS_HP_SDMMC_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_SDMMC_CTRL_REG (DR_REG_CNNT_BASE + 0x38)
/** CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN : R/W; bitpos: [29]; default: 0;
 *  this reg is used to enable the post_write function of the ahb2axi bridge for sdmmc
 */
#define CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN    (BIT(29))
#define CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN_M  (CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN_V << CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN_S)
#define CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN_V  0x00000001U
#define CNNT_SYS_SDMMC_AHB2AXI_POST_WRITE_EN_S  29
/** CNNT_SYS_SDMMC_RST_EN : R/W; bitpos: [30]; default: 0;
 *  hp sdmmc reset en
 */
#define CNNT_SYS_SDMMC_RST_EN    (BIT(30))
#define CNNT_SYS_SDMMC_RST_EN_M  (CNNT_SYS_SDMMC_RST_EN_V << CNNT_SYS_SDMMC_RST_EN_S)
#define CNNT_SYS_SDMMC_RST_EN_V  0x00000001U
#define CNNT_SYS_SDMMC_RST_EN_S  30
/** CNNT_SYS_SDMMC_FORCE_NORST : R/W; bitpos: [31]; default: 0;
 *  hp sdmmc force norst
 */
#define CNNT_SYS_SDMMC_FORCE_NORST    (BIT(31))
#define CNNT_SYS_SDMMC_FORCE_NORST_M  (CNNT_SYS_SDMMC_FORCE_NORST_V << CNNT_SYS_SDMMC_FORCE_NORST_S)
#define CNNT_SYS_SDMMC_FORCE_NORST_V  0x00000001U
#define CNNT_SYS_SDMMC_FORCE_NORST_S  31

/** CNNT_SYS_HP_EMAC_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_CTRL_REG (DR_REG_CNNT_BASE + 0x3c)
/** CNNT_SYS_EMAC_USELESS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_USELESS_CLK_EN    (BIT(0))
#define CNNT_SYS_EMAC_USELESS_CLK_EN_M  (CNNT_SYS_EMAC_USELESS_CLK_EN_V << CNNT_SYS_EMAC_USELESS_CLK_EN_S)
#define CNNT_SYS_EMAC_USELESS_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_USELESS_CLK_EN_S  0
/** CNNT_SYS_EMAC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RST_EN    (BIT(1))
#define CNNT_SYS_EMAC_RST_EN_M  (CNNT_SYS_EMAC_RST_EN_V << CNNT_SYS_EMAC_RST_EN_S)
#define CNNT_SYS_EMAC_RST_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RST_EN_S  1
/** CNNT_SYS_EMAC_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_FORCE_NORST    (BIT(2))
#define CNNT_SYS_EMAC_FORCE_NORST_M  (CNNT_SYS_EMAC_FORCE_NORST_V << CNNT_SYS_EMAC_FORCE_NORST_S)
#define CNNT_SYS_EMAC_FORCE_NORST_V  0x00000001U
#define CNNT_SYS_EMAC_FORCE_NORST_S  2

/** CNNT_SYS_HP_EMAC_REF_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_REF_CTRL_REG (DR_REG_CNNT_BASE + 0x40)
/** CNNT_SYS_EMAC_REF_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  select emac reference clock source. 0: mpll 500MHz, 1: cpll 300MHz.
 */
#define CNNT_SYS_EMAC_REF_CLK_SEL    0x00000003U
#define CNNT_SYS_EMAC_REF_CLK_SEL_M  (CNNT_SYS_EMAC_REF_CLK_SEL_V << CNNT_SYS_EMAC_REF_CLK_SEL_S)
#define CNNT_SYS_EMAC_REF_CLK_SEL_V  0x00000003U
#define CNNT_SYS_EMAC_REF_CLK_SEL_S  0
/** CNNT_SYS_EMAC_REF_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  Set as 1 to enable emac reference clock source selection
 */
#define CNNT_SYS_EMAC_REF_CLK_EN    (BIT(2))
#define CNNT_SYS_EMAC_REF_CLK_EN_M  (CNNT_SYS_EMAC_REF_CLK_EN_V << CNNT_SYS_EMAC_REF_CLK_EN_S)
#define CNNT_SYS_EMAC_REF_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_REF_CLK_EN_S  2
/** CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN    (BIT(3))
#define CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN_M  (CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN_V << CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN_S)
#define CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_REF_50M_PAD_OUT_CLK_EN_S  3
/** CNNT_SYS_EMAC_REF_CLK_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  Divide number of the divider which is used to divide reference clock source.
 */
#define CNNT_SYS_EMAC_REF_CLK_DIV_NUM    0x000000FFU
#define CNNT_SYS_EMAC_REF_CLK_DIV_NUM_M  (CNNT_SYS_EMAC_REF_CLK_DIV_NUM_V << CNNT_SYS_EMAC_REF_CLK_DIV_NUM_S)
#define CNNT_SYS_EMAC_REF_CLK_DIV_NUM_V  0x000000FFU
#define CNNT_SYS_EMAC_REF_CLK_DIV_NUM_S  8

/** CNNT_SYS_HP_EMAC_RMII_PAD_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_RMII_PAD_CTRL_REG (DR_REG_CNNT_BASE + 0x44)
/** CNNT_SYS_EMAC_RMII_PAD_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RMII_PAD_CLK_EN    (BIT(1))
#define CNNT_SYS_EMAC_RMII_PAD_CLK_EN_M  (CNNT_SYS_EMAC_RMII_PAD_CLK_EN_V << CNNT_SYS_EMAC_RMII_PAD_CLK_EN_S)
#define CNNT_SYS_EMAC_RMII_PAD_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RMII_PAD_CLK_EN_S  1
/** CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN    (BIT(2))
#define CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN_M  (CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN_V << CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN_S)
#define CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RMII_PAD_CLK_INV_EN_S  2

/** CNNT_SYS_HP_EMAC_RMII_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_RMII_CTRL_REG (DR_REG_CNNT_BASE + 0x48)
/** CNNT_SYS_EMAC_RMII_CLK_SEL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RMII_CLK_SEL    (BIT(0))
#define CNNT_SYS_EMAC_RMII_CLK_SEL_M  (CNNT_SYS_EMAC_RMII_CLK_SEL_V << CNNT_SYS_EMAC_RMII_CLK_SEL_S)
#define CNNT_SYS_EMAC_RMII_CLK_SEL_V  0x00000001U
#define CNNT_SYS_EMAC_RMII_CLK_SEL_S  0
/** CNNT_SYS_EMAC_RMII_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RMII_CLK_EN    (BIT(1))
#define CNNT_SYS_EMAC_RMII_CLK_EN_M  (CNNT_SYS_EMAC_RMII_CLK_EN_V << CNNT_SYS_EMAC_RMII_CLK_EN_S)
#define CNNT_SYS_EMAC_RMII_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RMII_CLK_EN_S  1
/** CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN    (BIT(2))
#define CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN_M  (CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN_V << CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN_S)
#define CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RMII_PAD_OUT_CLK_EN_S  2
/** CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM : R/W; bitpos: [12:8]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM    0x0000001FU
#define CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM_M  (CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM_V << CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM_S)
#define CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM_V  0x0000001FU
#define CNNT_SYS_EMAC_RXTX_CLK_DIV_NUM_S  8

