espressif/esp-idf/components/soc/esp32s31/register/soc/cnnt_sys_reg.h
/** CNNT_SYS_HP_EMAC_RX_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_RX_CTRL_REG (DR_REG_CNNT_BASE + 0x4c)
/** CNNT_SYS_EMAC_RX_PAD_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RX_PAD_CLK_EN    (BIT(0))
#define CNNT_SYS_EMAC_RX_PAD_CLK_EN_M  (CNNT_SYS_EMAC_RX_PAD_CLK_EN_V << CNNT_SYS_EMAC_RX_PAD_CLK_EN_S)
#define CNNT_SYS_EMAC_RX_PAD_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RX_PAD_CLK_EN_S  0
/** CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN    (BIT(1))
#define CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN_M  (CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN_V << CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN_S)
#define CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RX_PAD_CLK_INV_EN_S  1
/** CNNT_SYS_EMAC_RX_CLK_SEL : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RX_CLK_SEL    (BIT(2))
#define CNNT_SYS_EMAC_RX_CLK_SEL_M  (CNNT_SYS_EMAC_RX_CLK_SEL_V << CNNT_SYS_EMAC_RX_CLK_SEL_S)
#define CNNT_SYS_EMAC_RX_CLK_SEL_V  0x00000001U
#define CNNT_SYS_EMAC_RX_CLK_SEL_S  2
/** CNNT_SYS_EMAC_RX_180_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_RX_180_CLK_EN    (BIT(3))
#define CNNT_SYS_EMAC_RX_180_CLK_EN_M  (CNNT_SYS_EMAC_RX_180_CLK_EN_V << CNNT_SYS_EMAC_RX_180_CLK_EN_S)
#define CNNT_SYS_EMAC_RX_180_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_RX_180_CLK_EN_S  3

/** CNNT_SYS_HP_EMAC_TX_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_TX_CTRL_REG (DR_REG_CNNT_BASE + 0x50)
/** CNNT_SYS_EMAC_TX_PAD_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_TX_PAD_CLK_EN    (BIT(0))
#define CNNT_SYS_EMAC_TX_PAD_CLK_EN_M  (CNNT_SYS_EMAC_TX_PAD_CLK_EN_V << CNNT_SYS_EMAC_TX_PAD_CLK_EN_S)
#define CNNT_SYS_EMAC_TX_PAD_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_TX_PAD_CLK_EN_S  0
/** CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN    (BIT(1))
#define CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN_M  (CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN_V << CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN_S)
#define CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN_V  0x00000001U
#define CNNT_SYS_EMAC_TX_PAD_CLK_INV_EN_S  1
/** CNNT_SYS_EMAC_TX_CLK_SEL : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_TX_CLK_SEL    (BIT(2))
#define CNNT_SYS_EMAC_TX_CLK_SEL_M  (CNNT_SYS_EMAC_TX_CLK_SEL_V << CNNT_SYS_EMAC_TX_CLK_SEL_S)
#define CNNT_SYS_EMAC_TX_CLK_SEL_V  0x00000001U
#define CNNT_SYS_EMAC_TX_CLK_SEL_S  2
/** CNNT_SYS_EMAC_TX_180_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define CNNT_SYS_EMAC_TX_180_CLK_EN    (BIT(3))
#define CNNT_SYS_EMAC_TX_180_CLK_EN_M  (CNNT_SYS_EMAC_TX_180_CLK_EN_V << CNNT_SYS_EMAC_TX_180_CLK_EN_S)
#define CNNT_SYS_EMAC_TX_180_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_TX_180_CLK_EN_S  3

/** CNNT_SYS_HP_EMAC_PTP_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_HP_EMAC_PTP_CTRL_REG (DR_REG_CNNT_BASE + 0x54)
/** CNNT_SYS_EMAC_PTP_REF_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set as 1 to enable emac PTP clock source selection.
 */
#define CNNT_SYS_EMAC_PTP_REF_CLK_EN    (BIT(0))
#define CNNT_SYS_EMAC_PTP_REF_CLK_EN_M  (CNNT_SYS_EMAC_PTP_REF_CLK_EN_V << CNNT_SYS_EMAC_PTP_REF_CLK_EN_S)
#define CNNT_SYS_EMAC_PTP_REF_CLK_EN_V  0x00000001U
#define CNNT_SYS_EMAC_PTP_REF_CLK_EN_S  0
/** CNNT_SYS_EMAC_PTP_REF_CLK_SEL : R/W; bitpos: [1]; default: 0;
 *  select emac PTP clock source. 0: xtal clock, 1: 80MHz internal clock.
 */
#define CNNT_SYS_EMAC_PTP_REF_CLK_SEL    (BIT(1))
#define CNNT_SYS_EMAC_PTP_REF_CLK_SEL_M  (CNNT_SYS_EMAC_PTP_REF_CLK_SEL_V << CNNT_SYS_EMAC_PTP_REF_CLK_SEL_S)
#define CNNT_SYS_EMAC_PTP_REF_CLK_SEL_V  0x00000001U
#define CNNT_SYS_EMAC_PTP_REF_CLK_SEL_S  1

/** CNNT_SYS_CNNT_IOMUX_CTRL0_REG register
 *  need_des
 */
#define CNNT_SYS_CNNT_IOMUX_CTRL0_REG (DR_REG_CNNT_BASE + 0x58)
/** CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN : R/W; bitpos: [0]; default: 0;
 *  cnnt_iomux rst en
 */
#define CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN    (BIT(0))
#define CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN_M  (CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN_V << CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN_S)
#define CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN_V  0x00000001U
#define CNNT_SYS_REG_CNNT_IOMUX_APB_RST_EN_S  0

/** CNNT_SYS_SPRAM_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define CNNT_SYS_SPRAM_MEM_AUX_CTRL_REG (DR_REG_CNNT_BASE + 0x5c)
/** CNNT_SYS_SPRAM_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define CNNT_SYS_SPRAM_MEM_AUX_CTRL    0xFFFFFFFFU
#define CNNT_SYS_SPRAM_MEM_AUX_CTRL_M  (CNNT_SYS_SPRAM_MEM_AUX_CTRL_V << CNNT_SYS_SPRAM_MEM_AUX_CTRL_S)
#define CNNT_SYS_SPRAM_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define CNNT_SYS_SPRAM_MEM_AUX_CTRL_S  0

/** CNNT_SYS_GMAC_CTRL0_REG register
 *  N/A
 */
#define CNNT_SYS_GMAC_CTRL0_REG (DR_REG_CNNT_BASE + 0x60)
/** CNNT_SYS_PTP_PPS : RO; bitpos: [0]; default: 0;
 *  N/A
 */
#define CNNT_SYS_PTP_PPS    (BIT(0))
#define CNNT_SYS_PTP_PPS_M  (CNNT_SYS_PTP_PPS_V << CNNT_SYS_PTP_PPS_S)
#define CNNT_SYS_PTP_PPS_V  0x00000001U
#define CNNT_SYS_PTP_PPS_S  0
/** CNNT_SYS_SBD_FLOWCTRL : R/W; bitpos: [1]; default: 0;
 *  N/A
 */
#define CNNT_SYS_SBD_FLOWCTRL    (BIT(1))
#define CNNT_SYS_SBD_FLOWCTRL_M  (CNNT_SYS_SBD_FLOWCTRL_V << CNNT_SYS_SBD_FLOWCTRL_S)
#define CNNT_SYS_SBD_FLOWCTRL_V  0x00000001U
#define CNNT_SYS_SBD_FLOWCTRL_S  1
/** CNNT_SYS_PHY_INTF_SEL : R/W; bitpos: [4:2]; default: 0;
 *  N/A
 */
#define CNNT_SYS_PHY_INTF_SEL    0x00000007U
#define CNNT_SYS_PHY_INTF_SEL_M  (CNNT_SYS_PHY_INTF_SEL_V << CNNT_SYS_PHY_INTF_SEL_S)
#define CNNT_SYS_PHY_INTF_SEL_V  0x00000007U
#define CNNT_SYS_PHY_INTF_SEL_S  2
/** CNNT_SYS_GMAC_MEM_CLK_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  N/A
 */
#define CNNT_SYS_GMAC_MEM_CLK_FORCE_ON    (BIT(5))
#define CNNT_SYS_GMAC_MEM_CLK_FORCE_ON_M  (CNNT_SYS_GMAC_MEM_CLK_FORCE_ON_V << CNNT_SYS_GMAC_MEM_CLK_FORCE_ON_S)
#define CNNT_SYS_GMAC_MEM_CLK_FORCE_ON_V  0x00000001U
#define CNNT_SYS_GMAC_MEM_CLK_FORCE_ON_S  5
/** CNNT_SYS_GMAC_RST_CLK_TX_N : RO; bitpos: [6]; default: 0;
 *  N/A
 */
#define CNNT_SYS_GMAC_RST_CLK_TX_N    (BIT(6))
#define CNNT_SYS_GMAC_RST_CLK_TX_N_M  (CNNT_SYS_GMAC_RST_CLK_TX_N_V << CNNT_SYS_GMAC_RST_CLK_TX_N_S)
#define CNNT_SYS_GMAC_RST_CLK_TX_N_V  0x00000001U
#define CNNT_SYS_GMAC_RST_CLK_TX_N_S  6
/** CNNT_SYS_GMAC_RST_CLK_RX_N : RO; bitpos: [7]; default: 0;
 *  N/A
 */
#define CNNT_SYS_GMAC_RST_CLK_RX_N    (BIT(7))
#define CNNT_SYS_GMAC_RST_CLK_RX_N_M  (CNNT_SYS_GMAC_RST_CLK_RX_N_V << CNNT_SYS_GMAC_RST_CLK_RX_N_S)
#define CNNT_SYS_GMAC_RST_CLK_RX_N_V  0x00000001U
#define CNNT_SYS_GMAC_RST_CLK_RX_N_S  7
/** CNNT_SYS_GMAC_CACTIVE : RO; bitpos: [8]; default: 0;
 *  this signal indicates that the GMAC-AXI requires its clock signal , 1 : required ,0
 *  : not required
 */
#define CNNT_SYS_GMAC_CACTIVE    (BIT(8))
#define CNNT_SYS_GMAC_CACTIVE_M  (CNNT_SYS_GMAC_CACTIVE_V << CNNT_SYS_GMAC_CACTIVE_S)
#define CNNT_SYS_GMAC_CACTIVE_V  0x00000001U
#define CNNT_SYS_GMAC_CACTIVE_S  8
/** CNNT_SYS_GMAC_CSYSACK : RO; bitpos: [9]; default: 0;
 *  this signal is the acknowledgement from the GMAC-AXI to the system for low-power
 *  request ,active high
 */
#define CNNT_SYS_GMAC_CSYSACK    (BIT(9))
#define CNNT_SYS_GMAC_CSYSACK_M  (CNNT_SYS_GMAC_CSYSACK_V << CNNT_SYS_GMAC_CSYSACK_S)
#define CNNT_SYS_GMAC_CSYSACK_V  0x00000001U
#define CNNT_SYS_GMAC_CSYSACK_S  9
/** CNNT_SYS_GMAC_CSYSREQ : R/W; bitpos: [10]; default: 0;
 *  clock controller system low-power request , when asserted low ,indicates the
 *  controller hs requested the GMAX-AXI to enter a lowpower state
 */
#define CNNT_SYS_GMAC_CSYSREQ    (BIT(10))
#define CNNT_SYS_GMAC_CSYSREQ_M  (CNNT_SYS_GMAC_CSYSREQ_V << CNNT_SYS_GMAC_CSYSREQ_S)
#define CNNT_SYS_GMAC_CSYSREQ_V  0x00000001U
#define CNNT_SYS_GMAC_CSYSREQ_S  10
/** CNNT_SYS_GMAC_APB_POSTW_EN : R/W; bitpos: [11]; default: 0;
 *  N/A
 */
#define CNNT_SYS_GMAC_APB_POSTW_EN    (BIT(11))
#define CNNT_SYS_GMAC_APB_POSTW_EN_M  (CNNT_SYS_GMAC_APB_POSTW_EN_V << CNNT_SYS_GMAC_APB_POSTW_EN_S)
#define CNNT_SYS_GMAC_APB_POSTW_EN_V  0x00000001U
#define CNNT_SYS_GMAC_APB_POSTW_EN_S  11
/** CNNT_SYS_GMAC_MEM_PRDYN : RO; bitpos: [12]; default: 1;
 *  record memory power status
 */
#define CNNT_SYS_GMAC_MEM_PRDYN    (BIT(12))
#define CNNT_SYS_GMAC_MEM_PRDYN_M  (CNNT_SYS_GMAC_MEM_PRDYN_V << CNNT_SYS_GMAC_MEM_PRDYN_S)
#define CNNT_SYS_GMAC_MEM_PRDYN_V  0x00000001U
#define CNNT_SYS_GMAC_MEM_PRDYN_S  12

/** CNNT_SYS_GMAC_CTRL1_REG register
 *  N/A
 */
#define CNNT_SYS_GMAC_CTRL1_REG (DR_REG_CNNT_BASE + 0x64)
/** CNNT_SYS_PTP_TIMESTAMP_L : RO; bitpos: [31:0]; default: 0;
 *  N/A
 */
#define CNNT_SYS_PTP_TIMESTAMP_L    0xFFFFFFFFU
#define CNNT_SYS_PTP_TIMESTAMP_L_M  (CNNT_SYS_PTP_TIMESTAMP_L_V << CNNT_SYS_PTP_TIMESTAMP_L_S)
#define CNNT_SYS_PTP_TIMESTAMP_L_V  0xFFFFFFFFU
#define CNNT_SYS_PTP_TIMESTAMP_L_S  0

/** CNNT_SYS_GMAC_CTRL2_REG register
 *  N/A
 */
#define CNNT_SYS_GMAC_CTRL2_REG (DR_REG_CNNT_BASE + 0x68)
/** CNNT_SYS_PTP_TIMESTAMP_H : RO; bitpos: [31:0]; default: 0;
 *  N/A
 */
#define CNNT_SYS_PTP_TIMESTAMP_H    0xFFFFFFFFU
#define CNNT_SYS_PTP_TIMESTAMP_H_M  (CNNT_SYS_PTP_TIMESTAMP_H_V << CNNT_SYS_PTP_TIMESTAMP_H_S)
#define CNNT_SYS_PTP_TIMESTAMP_H_V  0xFFFFFFFFU
#define CNNT_SYS_PTP_TIMESTAMP_H_S  0

#ifdef __cplusplus
}
#endif
